"Part1" = "SLOVENSKY";
"Part2" = "APPLE INC.";
"Part3" = "SOFTVÉROVÁ LICENČNÁ ZMLUVA APLIKÁCIE SKRATKY PRE iOS";
"Part4" = "POZORNE SI PREČÍTAJTE TÚTO SOFTVÉROVÚ LICENČNÚ ZMLUVU („LICENCIU“) PREDTÝM, AKO ZAČNETE POUŽÍVAŤ SOFTVÉR SPOLOČNOSTI APPLE. POUŽÍVANÍM SOFTVÉRU APPLE SÚHLASÍTE S PODMIENKAMI UVEDENÝMI V TEJTO LICENCII. AK NESÚHLASÍTE S PODMIENKAMI UVEDENÝMI V TEJTO LICENCII, SOFTVÉR NEINŠTALUJTE A NEPOUŽÍVAJTE.";
"Part5" = "DÔLEŽITÁ POZNÁMKA: V rozsahu, v ktorom bude tento softvér používaný na reprodukciu, modifikáciu, publikovanie a distribúciu rôznych materiálov, jeho licencia je vám poskytnutá len na reprodukciu, modifikáciu, publikovanie a distribúciu materiálov, ktoré nie sú chránené autorskými právami, prípadne materiálov, ktorých autorské práva vlastníte vy alebo ste poverení, resp. oprávnení na ich reprodukciu, modifikáciu, publikovanie alebo distribúciu. Ak si nie ste istí svojimi právami na kopírovanie, úpravu, zverejnenie alebo distribúciu materiálov, obráťte sa na svojho právneho poradcu.";
"Part6" = "1. Všeobecné podmienky.";
"Part7" = "A. Na základe podmienok tejto licencie vám spoločnosť Apple Inc. (ďalej len „Apple“) poskytuje (nepredáva) licenciu na softvér Apple a každý softvér, dokumentáciu, rozhrania, obsah, písma a akékoľvek dáta tretej strany, na ktoré sa vzťahuje táto licencia, bez ohľadu na to, či sa nachádzajú v pamäti iba na čítanie alebo na inom médiu, a bez ohľadu na ich formát (súhrne ďalej len „softvér Apple“). Spoločnosť Apple alebo jej poskytovatelia licencií si ponechávajú vlastníctvo samotného softvéru Apple a vyhradzujú si všetky práva, ktoré vám výslovne neboli udelené. ";
"Part8" = "B. Spoločnosť Apple môže podľa vlastného uváženia sprístupniť budúce aktualizácie softvéru Apple pre vaše kompatibilné zariadenie iOS značky Apple. Prípadné inovácie a aktualizácie softvéru Apple nemusia nevyhnutne obsahovať všetky existujúce funkcie alebo nové softvérové funkcie, ktoré Apple vydáva pre novšie alebo iné modely zariadení iOS. Podmienky uvedené v tejto licencii sa vzťahujú na akékoľvek softvérové inovácie alebo aktualizácie poskytnuté spoločnosťou Apple pre pôvodný softvér Apple, pokiaľ nie je k takejto aktualizácii alebo inovácii priložená osobitná licencia. V takom prípade súhlasíte, že podmienky priloženej licencie platia pre danú aktualizáciu alebo inováciu. ";
"Part9" = "2. Práva a obmedzenia vyplývajúce z tejto licencie.";
"Part10" = "A. Licencia. V súlade so zmluvnými podmienkami uvedenými v tejto licencii a povolením udeleným v „pravidlách používania služieb a obsahu“ obsiahnutých v zmluvných podmienkach mediálnych služieb spoločnosti Apple (https://www.apple.com/legal/internet-services/itunes/) (ďalej len „pravidlá používania“) platí, že ak ste softvér Apple nezískali podľa popisu v časti 2B, udeľuje sa vám obmedzená neprenosná a nevýhradná licencia na inštaláciu a používanie softvéru Apple na akomkoľvek kompatibilnom zariadení iOS značky Apple, ktoré vlastníte alebo používate. Šírenie alebo distribúcia softvéru Apple prostredníctvom siete, na ktorej by mohol byť používaný viacerými zariadeniami naraz, je zakázané. Je zakázané prenajímať, požičiavať, predávať, nanovo distribuovať alebo licencovať softvér Apple.";
"Part11" = "B. Hromadná licencia alebo licencia na údržbu. Ak ste softvér Apple získali v rámci hromadnej licencie alebo licencie na program údržby spoločnosti Apple, počet kópií softvéru Apple, ktoré môžete stiahnuť, nainštalovať, používať a spúšťať v zariadeniach iOS značky Apple, ktoré používate alebo vlastníte, určujú podmienky hromadnej licencie alebo licencie na údržbu. Všetky ostatné pravidlá a podmienky tejto licencie sa vzťahujú na vaše používanie softvéru Apple získaného na základe multilicencie alebo licencie na údržbu, okrem prípadov, keď to bude dohodnuté inak so spoločnosťou Apple písomnou formou.";
"Part12" = "C. Systémové požiadavky. Softvér Apple je podporovaný len na značkovom hardvéri Apple, ktorý spĺňa systémové požiadavky uvedené spoločnosťou Apple.";
"Part13" = "D. Obsah a digitálne materiály. Vlastnícke práva a práva na duševné vlastníctvo voči obsahu zobrazenému alebo získanému prostredníctvom softvéru Apple vrátane ochranných známok, log a obrázkov patria príslušnému vlastníkovi daného obsahu. Takýto obsah môže byť chránený autorským právom, ochrannou známkou alebo ďalšími zákonmi a dohodami o ochrane intelektuálneho vlastníctva a jeho používanie môže podliehať podmienkam používania tretej strany, ktorá obsah poskytuje. Ak nie je v tejto licencii stanovené inak, (i) táto licencia vám neudeľuje žiadne práva na používanie takéhoto obsahu a takisto nezaručuje, že tento obsah bude pre vás naďalej dostupný a (ii) nesmiete samostatne používať, extrahovať ani distribuovať, komerčne ani iným spôsobom, žiadne fotografie, logá, text, kód, obrázky, grafické prvky, umelecké diela, zvuk, video ani podobný majetok (ďalej len „digitálne materiály“), ktorý je tu obsiahnutý alebo poskytovaný ako súčasť softvéru Apple, ani iným spôsobom používať digitálne materiály mimo kontextu jeho zamýšľaného použitia v rámci softvéru Apple.";
"Part14" = "E. Používanie skratiek. Beriete na vedomie, že za všetky skratky akcií v aplikáciách a na webových stránkach („skratky“) zodpovedá výhradne subjekt alebo subjekty, od ktorých takéto skratky pochádzajú. Spoločnosť Apple nemá žiadnu kontrolu nad obsahom a funkciami skratiek tretích strán a nepreberá za ne žiadnu zodpovednosť. Všetky skratky používate na vlastné riziko a nesiete výhradnú zodpovednosť za dodržiavanie zmlúv a dohôd s tretími stranami v súvislosti s vaším používaním akýchkoľvek skratiek. Beriete na vedomie, že spoločnosť Apple nie je povinná vykonávať predbežnú kontrolu skratiek, hoci si vyhradzuje právo podľa svojho vlastného uváženia všetky skratky predbežne kontrolovať, odmietať, deaktivovať a odstraňovať.";
"Part15" = "F. Zdieľanie skratiek. Softvér Apple vám môže umožňovať zdieľanie skratiek, ktoré vytvoríte, s inými používateľmi prostredníctvom webových odkazov. Skratky, ktoré zdieľate, budú spolu so všetkým obsahom, ktorý je v nich vložený, uložené na serveroch spoločnosti Apple na účely umožnenia takéhoto zdieľania a môžu byť použité na všeobecné vylepšovanie produktov a služieb spoločnosti Apple. Skratka, ktorú zdieľate, bude spolu so všetkým v nej vloženým obsahom k dispozícii komukoľvek, kto má k webovému odkazu prístup. Takýto používateľ potom môže vašu skratku spolu s celým vloženým obsahom skopírovať a kópiu uložiť, upraviť a ďalej šíriť. Zdieľaním skratky záväzne vyhlasujete, že (1) máte k takejto skratke všetky potrebné práva a licencie a že jej zverejnením a používaním nedôjde k prekročeniu ani porušeniu práv žiadnej tretej strany a (2) žiadna vami zdieľaná skratka neporuší žiadne zákony a neprispeje ani nebude podnecovať k prekročeniu zákona alebo inému nezákonnému konaniu a nebude vykazovať žiadnu inú nemorálnu alebo problematickú činnosť. Beriete na vedomie, že spoločnosť Apple nie je povinná vykonávať kontrolu žiadnych vami zdieľaných skratiek, hoci si vyhradzuje právo podľa svojho vlastného uváženia skontrolovať, odmietnuť, deaktivovať alebo odstrániť akékoľvek skratky, ktoré zdieľate.";
"Part16" = "G. Obmedzenie použitia. Súhlasíte s tým, že nebudete odosielať, zverejňovať, posielať e-mailom, prenášať, zdieľať ani inak sprístupňovať žiadne skratky, ktoré: (1) majú nezákonný, protiprávny, hanlivý, vulgárny, nemravný, urážlivý alebo rasovo, etnicky alebo inak napadnuteľný obsah; (2) porušujú akékoľvek platné zákony alebo predpisy alebo podnecujú správanie, ktoré by ich porušovalo alebo mohlo mať za následok občianskoprávnu zodpovednosť; (3) podporujú diskrimináciu, náboženskú neznášanlivosť, rasizmus, nenávisť, zastrašovanie alebo poškodzovanie akéhokoľvek jedinca alebo skupiny; (4) majú násilný alebo výhražný obsah alebo podporujú násilie alebo činnosti ohrozujúce akúkoľvek inú osobu; (5) podporujú nezákonné alebo škodlivé činnosti alebo (6) podľa vášho vedomia alebo presvedčenia môžu používateľa uviesť do omylu, zmiasť, podviesť alebo iným spôsobom oklamať. Ďalej súhlasíte s tým, že nebudete narušovať ani prerušovať činnosť serverov a sietí pripojených k softvéru Apple a k iným softvérovým aplikáciám, službám či webovým stránkam tretích strán na vašom zariadení iOS („aplikácie tretích strán“), ani tieto servery a siete nadmerne zaťažovať, a že nebudete porušovať predpisy, pravidlá a protokoly týchto sietí a aplikácií tretích strán.";
"Part17" = "H. Aplikácie tretích strán. Na vykonávanie niektorých skratiek potrebuje softvér Apple prístup k určitým aplikáciám tretích strán. Výslovne vyjadrujete svoj súhlas a udeľujete softvéru Apple povolenie na prístup a používanie týchto aplikácií tretích strán vo vašom mene v rozsahu potrebnom na to, aby softvér Apple mohol príslušnú skratku vykonať. V rozsahu, v akom softvér Apple pristupuje k ľubovoľným aplikáciám tretích strán, sa na spoločnosť Apple nevzťahuje žiadna výslovná ani predpokladaná povinnosť poskytovať k týmto aplikáciám tretích strán akúkoľvek technickú alebo inú podporu. So žiadosťami o technickú podporu a zákaznícky servis súvisiacimi so softvérom, službami, webovými stránkami a produktmi tretích strán sa obracajte priamo na príslušného dodávateľa softvéru, výrobcu alebo poskytovateľa služieb. ĎALEJ SÚHLASÍTE S TÝM, ŽE PRI POUŽÍVANÍ SOFTVÉRU APPLE SA NA VÁS VZŤAHUJÚ VŠETKY PRÍSLUŠNÉ PODMIENKY POSKYTOVANIA SLUŽIEB A INÉ ZMLUVY K APLIKÁCIÁM TRETÍCH STRÁN A ŽE ICH BUDETE DODRŽIAVAŤ. NESIETE VÝHRADNÚ ZODPOVEDNOSŤ ZA TO, ŽE VŠETKY SKRATKY BUDÚ SPĹŇAŤ PLATNÉ PODMIENKY VŠETKÝCH APLIKÁCIÍ TRETÍCH STRÁN, KTORÉ TIETO SKRATKY POUŽIJÚ. SPOLOČNOSŤ APPLE ŽIADNYM SPÔSOBOM NEZARUČUJE, ŽE SKRATKY BUDÚ SPĹŇAŤ PODMIENKY ĽUBOVOĽNEJ APLIKÁCIE TRETEJ STRANY, A NEZODPOVEDÁ ZA ŽIADNE SKRATKY POCHÁDZAJÚCE OD TRETÍCH STRÁN.";
"Part18" = "I. Zákaz spätného inžinierstva. Nemôžete a súhlasíte s tým, že nebudete a rovnako, že neumožníte iným osobám kopírovať (s výnimkou prípadov jednoznačne uvedených v tejto licencii alebo v podmienkach používania v prípade, že sa na vás vzťahujú), dekompilovať, aplikovať spätné inžinierstvo, rozoberať, pokúšať sa získať zdrojový kód, dekódovať, upravovať alebo vytvárať diela odvodené od softvéru Apple, alebo od akýchkoľvek služieb poskytovaných softvérom Apple, alebo akejkoľvek vyššie uvedenej časti (s výnimkou a len v rozsahu, kedy ktorákoľvek vyššie uvedená činnosť je zakázaná príslušným právom, alebo v rozsahu povolenom licenčnými podmienkami, určujúcimi využívanie Open Source komponentov, ktoré sú súčasťou softvéru Apple). ";
"Part19" = "J. Dodržiavanie zákonov. Súhlasíte s tým, že budete používať softvér Apple a služby (tak, ako sú definované v časti 4) v súlade so všetkými príslušnými zákonmi vrátane miestnych zákonov krajiny alebo oblasti, v ktorej bývate, alebo v ktorej sťahujete alebo používate softvér Apple a služby.";
"Part20" = "K. Automatické aktualizácie. Ak sa rozhodnete povoliť automatické aktualizácie aplikácií, vaše zariadenie bude pravidelne v spoločnosti Apple kontrolovať, či sú k dispozícii inovácie a aktualizácie softvéru Apple, a ak sú, inovácia alebo aktualizácia sa automaticky stiahne a nainštaluje do vášho zariadenia a prípadne do periférnych zariadení. Automatické aktualizácie aplikácií môžete kedykoľvek úplne vypnúť zmenou nastavení automatických aktualizácií aplikácií, ktoré sa nachádzajú v Nastaveniach.";
"Part21" = "3. Súhlas s použitím údajov. ";
"Part22" = "A. Analytické údaje. Ak sa rozhodnete umožniť zber analytických údajov, súhlasíte s tým, že spoločnosť Apple a jej dcérske spoločnosti a agenti môžu zhromažďovať, uchovávať, spracovávať a využívať diagnostické a technické informácie a informácie o používaní a s tým súvisiace informácie vrátane, nie však výhradne, jedinečných systémových alebo hardvérových identifikátorov, informácií o vašom zariadení iOS, počítači, systémovom a aplikačnom softvéri a perifériách, ktoré sú pravidelne zhromažďované na poskytovanie a zlepšovanie produktov a služieb spoločnosti Apple a na uľahčovanie poskytovania softvérových aktualizácií, podpory produktu a ostatných vám poskytovaných služieb (ak existujú) súvisiacich so softvérom Apple a na overovanie dodržiavania podmienok uvedených v tejto licencii. Spoločnosť Apple môže využívať takéto informácie, pokiaľ sú zhromažďované v podobe, ktorá neumožňuje vašu osobnú identifikáciu, na účely opísané vyššie. Za účelom vylepšenia softvéru, hardvéru a služieb určených na použitie s produktmi Apple od partnerov Apple alebo vývojárov tretích strán, môže spoločnosť Apple poskytnúť týmto partnerom a vývojárom časť týchto diagnostických údajov, ktoré sú relevantné z hľadiska softvéru, hardvéru a/alebo služby partnera či tretej strany, pokiaľ sú tieto údaje poskytované v podobe, ktorá neumožňuje vašu osobnú identifikáciu. ";
"Part23" = "B. Informácie o polohe. Spoločnosť Apple a jej partneri, držitelia jej licencií a vývojári tretích strán môžu prostredníctvom softvéru Apple poskytovať isté služby, ktoré sú závislé na informáciách o polohe. Aby mohli byť tieto služby poskytované a vylepšované tam, kde to je možné, spoločnosť Apple, jej partneri, držitelia licencií a vývojári tretích strán môžu prenášať, zhromažďovať, udržiavať, spracovávať a využívať údaje o vašej polohe. Informácie o polohe a žiadosti získané spoločnosťou Apple sú zhromažďované vo forme, ktorá vás osobne neidentifikuje a môžu byť použité spoločnosťou Apple a jej partnermi, držiteľmi licencií a vývojármi tretích strán na poskytovanie a vylepšovanie produktov a služieb využívajúcich informácie o polohe. Používaním akýchkoľvek služieb poskytovaných pomocou alebo prostredníctvom softvéru Apple súhlasíte s tým, aby spoločnosť Apple a jej partneri, držitelia licencií a vývojári tretích strán prenášali, zhromažďovali, udržiavali, spracovávali a využívali údaje o vašej polohe a žiadosti s cieľom poskytovania a vylepšovania takýchto produktov a služieb. Tento súhlas môžete kedykoľvek odvolať tak, že prejdete do nastavenia služby polohy v zariadení iOS a buď vypnete globálne nastavenie služby polohy, alebo vypnete jednotlivé nastavenia polohy pre softvér Apple. Pri použití aplikácií tretích strán alebo služieb v zariadení iOS, ktoré používajú alebo poskytujú služby určovania polohy, by ste si mali prečítať práva a podmienky ochrany osobných údajov pre tieto aplikácie alebo služby tretích strán.";
"Part24" = "C. Ochrana osobných údajov. S vašimi osobnými údajmi sa po celý čas bude zaobchádzať v súlade so zásadami ochrany osobných údajov spoločnosti Apple, ktoré sú dostupné na nasledujúcej adrese: https://www.apple.com/legal/privacy/.";
"Part25" = "4. Služby a materiály tretích strán.";
"Part26" = "A. Všeobecné. Softvér Apple môže umožniť prístup do služieb iTunes Store, App Store, iCloud, Mapy a ďalších služieb a webových stránok („služby“) spoločnosti Apple a tretích strán (súhrnne označované ako „služby“). Tieto služby nemusia byť dostupné vo všetkých jazykoch ani vo všetkých krajinách. Na využívanie služieb je nutný prístup na internet. Využívanie určitých služieb vyžaduje Apple ID a niektoré služby vyžadujú súhlas s dodatočnými podmienkami, prípadne môžu byť dodatočne spoplatnené. Používaním tohto softvéru v spojení s účtom iTunes Store, Apple ID alebo inou službou Apple súhlasíte s podmienkami zodpovedajúcej služby, ako sú napríklad aktuálne zmluvné podmienky mediálnych služieb spoločnosti Apple, ktoré sú dostupné na adrese https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. Ak sa rozhodnete využívať služby iCloud prostredníctvom softvéru Apple, takéto využitie podlieha nasledujúcim dodatočným podmienkam: podmienky používania služieb iCloud dostupné na stránke https://www.apple.com/legal/internet-services/icloud/ a pravidlá ochrany súkromia Apple dostupné na stránke https://www.apple.com/legal/privacy/.";
"Part28" = "C. Beriete na vedomie, že pri používaní služieb sa môžete stretnúť s materiálmi, ktoré je možné považovať za urážlivé, nemravné alebo nevhodné a ktoré môžu, ale nemusia, obsahovať vulgarizmy. Napriek tomu súhlasíte s používaním služieb na vašu vlastnú zodpovednosť a s tým, že spoločnosť Apple nenesie zodpovednosť za obsah, ktorý je možné označiť ako urážlivý, nemravný alebo nevhodný. ";
"Part29" = "D. Niektoré služby môžu zobrazovať, zahŕňať, alebo sprístupňovať služby, obsah, dáta, informácie, aplikácie alebo materiály tretích strán („materiály tretích strán“), alebo odkazovať na webové stránky alebo aplikácie tretích strán. Používaním služieb beriete na vedomie a súhlasíte s tým, že spoločnosť Apple nie je zodpovedná za skúmanie a vyhodnocovanie obsahu, správnosti, úplnosti, aktuálnosti, platnosti, legálnosti, dodržiavania autorských práv, slušnosti, kvality a akýchkoľvek ďalších aspektov takýchto materiálov tretích strán, aplikácií alebo webových stránok. Spoločnosť Apple, jej zamestnanci a dcérske spoločnosti nenesú žiadnu zodpovednosť, nesúhlasia, ani nebudú súhlasiť s nesením zodpovednosti za služby a materiály tretích strán, aplikácie, webové stránky alebo akékoľvek ďalšie materiály, produkty, alebo služby tretích strán voči vám alebo komukoľvek inému. Materiály tretích strán a odkazy na iné webové stránky alebo aplikácie sú vám poskytované výhradne pre vaše vlastné pohodlie.";
"Part30" = "E. V prípade, že odosielate obsah pomocou služieb, vyjadrujete, že ste vlastníkom všetkých práv, alebo ste oprávnení alebo máte iné právne povolenie, na odosielanie tohto obsahu a že tento obsah nepredstavuje porušenie podmienok poskytovania služby vzťahujúcich sa na služby. Súhlasíte s tým, že služby obsahujú zákonom chránený obsah, informácie a materiály, vrátane (ale nielen) akýchkoľvek digitálnych materiálov, ktoré vlastní spoločnosť Apple, majiteľ stránky alebo držitelia ich licencií, a že sú chránené príslušnými zákonmi na ochranu intelektuálneho duševného vlastníctva a ďalšími zákonmi vrátane, nie však výhradne, autorských práv. Súhlasíte s tým, že nebudete využívať tento zákonom chránený obsah, informácie alebo materiály iné, ako pripúšťa využívanie služieb, ani akýmkoľvek iným spôsobom, ktorý odporuje podmienkam uvedeným v tejto licencii alebo narúša práva súvisiace s intelektuálnym vlastníctvom tretej strany alebo spoločnosti Apple. Žiadna časť služieb nesmie byť reprodukovaná akýmkoľvek spôsobom v akejkoľvek podobe. Súhlasíte s tým, že nebudete upravovať, prenajímať, požičiavať, predávať, distribuovať, alebo vytvárať odvodené diela založené na službách akýmkoľvek spôsobom a nebudete zneužívať služby akýmkoľvek neoprávneným spôsobom vrátane prenosu vírusov, červov, trójskych koní a podobného malvéru a tiež vrátane neoprávneného prieniku alebo preťažovania kapacity siete. Ďalej súhlasíte s tým, že nebudete využívať služby akýmkoľvek spôsobom na obťažovanie, urážanie, sledovanie, zastrašovanie, hanobenie, alebo akékoľvek iné zasahovanie do práv inej strany a že spoločnosť Apple v žiadnom prípade nenesie zodpovednosť za takéto vaše používanie služieb, ani za akékoľvek správy alebo prenosy, ktoré vám budú doručené pri používaní služieb a ich obsah vás obťažuje, zastrašuje, hanobí, je pohoršujúci, alebo nelegálny.";
"Part31" = "F. Služby a materiály tretích strán, ku ktorým môžete pristupovať, na ktoré môžete odkazovať alebo ktoré môžete zobrazovať pomocou softvéru Apple, nemusia byť okrem toho dostupné vo všetkých jazykoch, všetkých krajinách alebo regiónoch. Spoločnosť Apple netvrdí, že takéto služby a materiály tretích strán sú vhodné alebo dostupné na používanie na akomkoľvek konkrétnom mieste. V rozsahu, v akom sa rozhodnete používať alebo pristupovať k takýmto službám a materiálom tretích strán, tak robíte z vlastnej vôle a nesiete zodpovednosť za dodržiavanie akýchkoľvek platných zákonov vrátane (ale nielen) miestnych zákonov a zákonov o ochrane osobných údajov a zhromažďovaní údajov. Spoločnosť Apple a jej poskytovatelia licencií si vyhradzujú právo zmeniť, pozastaviť, odstrániť alebo zablokovať prístup ku ktorejkoľvek službe kedykoľvek a bez predchádzajúceho upozornenia. Spoločnosť Apple nebude za žiadnych okolností zodpovedná za odstránenie alebo zablokovanie prístupu k akýmkoľvek službám. Spoločnosť Apple môže tiež zaviesť obmedzenia na používanie alebo pristupovanie k určitým službám kedykoľvek a bez predchádzajúceho upozornenia. ";
"Part32" = "5. Ukončenie. Táto licencia je platná až do jej ukončenia. Práva, ktoré sú vám vyhradené touto licenciou, automaticky a bez upozornenia od spoločnosti Apple zanikajú alebo inak prestávajú byť účinné v prípade, že porušíte ktorúkoľvek z podmienok uvedených v tejto licencii. Po ukončení tejto licencie by ste mali prestať používať softvér Apple a zničiť všetky kópie softvéru Apple, celé alebo čiastočné. Časti 2I, 3, 4, 5, 6, 7, 8, 10 a 11 tejto licencie ostávajú v platnosti aj po akejkoľvek uvedenej forme zrušenia tejto zmluvy.";
"Part33" = "6. Zrieknutie sa záruk. ";
"Part34" = "A. Ak ste zákazník – spotrebiteľ (niekto, kto používa softvér Apple na súkromné účely), je možné, že na základe práv a zákonov krajiny pobytu sa na vás nebudú vzťahovať nasledovné obmedzenia. Ak sa chcete dozvedieť viac o vašich spotrebiteľských právach, kontaktujte miestnu organizáciu, ktorá má na starosti poradenstvo pre spotrebiteľov.";
"Part35" = "B. TÝMTO VYJADRUJETE SVOJ VEDOMÝ SÚHLAS S TÝM, ŽE V ROZSAHU POVOLENOM PRÍSLUŠNÝMI ZÁKONMI JE POUŽÍVANIE SOFTVÉRU A SLUŽIEB APPLE POSKYTOVANÝCH ALEBO DOSTUPNÝCH PROSTREDNÍCTVOM SOFTVÉRU APPLE, NA VAŠE VLASTNÉ RIZIKO A ZODPOVEDNOSŤ ZA TIETO RIZIKÁ, TÝKAJÚCE SA USPOKOJIVEJ KVALITY, VÝKONNOSTI, PRESNOSTI A VÝKONU, SPOČÍVA NA VÁS. ";
"Part36" = "C. SOFTVÉR APPLE A SLUŽBY SÚ DO MAXIMÁLNEJ MIERY POVOLENEJ ZÁKONOM POSKYTOVANÉ „TAK, AKO SÚ“, A „TAK, AKO SÚ DOSTUPNÉ“, SO VŠETKÝMI NEDOSTATKAMI A BEZ AKEJKOĽVEK ZÁRUKY. SPOLOČNOSŤ APPLE A JEJ POSKYTOVATELIA LICENCIÍ (NA ÚČELY ČASTÍ 6 A 7 SÚHRNNE ĎALEJ LEN „APPLE“) SA TÝMTO ZRIEKAJÚ VŠETKÝCH ZÁRUK A PODMIENOK TÝKAJÚCICH SA SOFTVÉRU APPLE ALEBO SLUŽIEB, ČI UŽ VÝSLOVNÝCH, IMPLICITNÝCH ALEBO ZÁKONNÝCH VRÁTANE, NIE VŠAK VÝHRADNE, IMPLICITNÝCH ZÁRUK A/ALEBO PODMIENOK OBCHODOVATEĽNOSTI, USPOKOJIVOSTI KVALITY, VHODNOSTI NA KONKRÉTNY ÚČEL POUŽITIA, PRESNOSTI, NERUŠENÉHO POUŽÍVANIA A NEPORUŠOVANIA PRÁV TRETÍCH STRÁN. ";
"Part37" = "D. SPOLOČNOSŤ APPLE NERUČÍ ZA PRERUŠENIE VÁŠHO PÔŽITKU ZO SOFTVÉRU APPLE A JEHO SLUŽIEB, ANI ZA TO, ŽE FUNKCIE, KTORÉ ZAHŔŇA, ALEBO SLUŽBY, KTORÉ VYKONÁVA ALEBO POSKYTUJE, BUDÚ SPĹŇAŤ VAŠE POŽIADAVKY. APPLE TIEŽ NERUČÍ ZA TO, ŽE CHOD SOFTVÉRU APPLE A JEHO SLUŽIEB BUDE NIČÍM NEPRERUŠENÝ ALEBO BEZCHYBNÝ, ŽE AKÁKOĽVEK SLUŽBA BUDE POSKYTOVANÁ NEUSTÁLE, ŽE SOFTVÉR APPLE ALEBO SLUŽBY BUDÚ OPRAVENÉ ALEBO ŽE SOTVÉR APPLE BUDE KOMPATIBILNÝ ALEBO SPOLUPRACUJÚCI SO SOFTVÉROM, APLIKÁCIAMI ALEBO SLUŽBAMI TRETÍCH STRÁN. INŠTALÁCIA TOHTO SOFTVÉRU APPLE MÔŽE MAŤ VPLYV NA DOSTUPNOSŤ A POUŽITEĽNOSŤ SOFTVÉRU, APLIKÁCIÍ ALEBO SLUŽIEB TRETÍCH STRÁN, AKO AJ PRODUKTOV A SLUŽIEB SPOLOČNOSTI APPLE.";
"Part38" = "E. ĎALEJ SÚHLASÍTE S TÝM, ŽE SOFTVÉR APPLE A JEHO SLUŽBY NIE SÚ URČENÉ ALEBO VHODNÉ NA POUŽITIE V SITUÁCIÁCH ALEBO V PROSTREDÍ, V KTOROM ZLYHANIE, ČASOVÉ PRESTOJE, CHYBY ALEBO NEZROVNALOSTI V OBSAHU, DÁTACH ALEBO INFORMÁCIÁCH ČERPANÝCH ZO SOFTVÉRU APPLE ALEBO JEHO SLUŽIEB, MÔŽU VIESŤ K SMRTI, OSOBNÉMU ZRANENIU ALEBO ŤAŽKÉMU FYZICKÉMU POŠKODENIU, ČI POŠKODENIU ŽIVOTNÉHO PROSTREDIA, BEZMEDZNE ZAHŔŇAJÚC OBSLUHOVANIE NUKLEÁRNYCH ZARIADENÍ, VZDUŠNEJ NAVIGÁCIE ALEBO KOMUNIKAČNÝCH SYSTÉMOV, RIADENIE VZDUŠNEJ PREVÁDZKY, SYSTÉMY PRE PODPORU ŽIVOTNÝCH FUNKCIÍ A SYSTÉMY RIADENIA ZBRANÍ.";
"Part39" = "F. ŽIADNA ÚSTNA ALEBO PÍSOMNÁ INFORMÁCIA, KTORÚ POSKYTNE APPLE ALEBO JEHO AUTORIZOVANÝ ZÁSTUPCA, NESLÚŽI AKO ZÁRUKA. AK SA UKÁŽE, ŽE SOFTVÉR ALEBO SLUŽBY APPLE SÚ CHYBNÉ, CELKOVÉ NÁKLADY NA VŠETKU POTREBNÚ ÚDRŽBU, OPRAVY ALEBO NÁPRAVY SÚ VO VAŠEJ VLASTNEJ RÉŽII. VZHĽADOM NA TO, ŽE NIEKTORÉ PRÁVNE SYSTÉMY NEPOVOĽUJÚ VYŇATIE IMPLICITNÝCH ZÁRUK ALEBO OBMEDZENÍ NA UPLATNITEĽNÉ ZÁKONOM URČENÉ SPOTREBITEĽSKÉ PRÁVA, JE MOŽNÉ, ŽE SA NA VÁS VYŠŠIE UVEDENÉ VÝNIMKY A OBMEDZENIA NEVZŤAHUJÚ. ";
"Part40" = "7. Obmedzenie zodpovednosti. AŽ DO ROZSAHU NEZAKÁZANÉHO PRÍSLUŠNÝM ZÁKONOM SPOLOČNOSŤ APPLE V ŽIADNOM PRÍPADE NEZODPOVEDÁ ZA OSOBNÉ ZRANENIA ANI ŽIADNE NÁHODNÉ, ZVLÁŠTNE, NEPRIAME ALEBO NÁSLEDNÉ ŠKODY (VRÁTANE, NIE VŠAK VÝHRADNE, ŠKÔD Z DÔVODU STRATY ZISKOV, POŠKODENIA ALEBO STRATY ÚDAJOV, CHYBY PRI ODOSIELANÍ ALEBO PRIJÍMANÍ ÚDAJOV, PRERUŠENIA OBCHODU ALEBO AKÉKOĽVEK ĎALŠÍCH OBCHODNÝCH ÚJM ALEBO STRÁT VZNIKNUTÝCH V DÔSLEDKU ALEBO SÚVISIACICH S VAŠÍM POUŽÍVANÍM ALEBO VAŠOU NESCHOPNOSŤOU POUŽÍVAŤ SOFTVÉR APPLE A SLUŽBY ALEBO AKÝKOĽVEK SOFTVÉR ČI APLIKÁCIE TRETÍCH STRÁN SPOJENÉ SO SOFTVÉROM APPLE SPÔSOBENÉ AKÝMKOĽVEK SPÔSOBOM A BEZ OHĽADU NA TEÓRIU O ZODPOVEDNOSTI (PROSTREDNÍCTVOM ZMLUVY, SPORU ALEBO INAK), DOKONCA ANI KEĎ BOLA SPOLOČNOSŤ APPLE NA MOŽNOSŤ TÝCHTO ŠKÔD UPOZORNENÁ. VZHĽADOM NA TO, ŽE NIEKTORÉ PRÁVNE SYSTÉMY NEPOVOĽUJÚ VYLÚČENIE ALEBO OBMEDZENIE ZODPOVEDNOSTI ZA OSOBNÉ ZRANENIE ALEBO NÁHODNÉ ČI SÚVISIACE UJMY, JE MOŽNÉ, ŽE SA NA VÁS VYŠŠIE UVEDENÉ VÝNIMKY A OBMEDZENIA NEVZŤAHUJÚ. Výška odškodného v rámci zodpovednosti spoločnosti Apple voči vašim stratám (iná, než vyžadovaná platným zákonom v prípadoch osobného zranenia) nemôže v žiadnom prípade presiahnuť päťdesiat dolárov (50,00 USD). Predchádzajúce obmedzenia platia aj v prípade, že vyššie uvedená náprava nesplní svoj pôvodný účel.";
"Part41" = "8. Kontrola exportu. Softvér Apple nemôžete žiadnym spôsobom exportovať alebo reexportovať, ani používať inak, než je povolené zákonmi Spojených štátov amerických a zákonmi jurisdikcií, v ktorých ste softvér Apple zakúpili. Softvér Apple nemôžete exportovať alebo reexportovať predovšetkým, ale nielen a) do krajín, na ktoré USA uvalili embargo alebo b) komukoľvek uvedenému v zozname zvláštne určených štátnych príslušníkov Ministerstva financií USA, v zozname nežiaducich osôb alebo subjektov Ministerstva obchodu USA alebo v akýchkoľvek iných zoznamoch zakázaných subjektov. Používaním softvéru Apple vyjadrujete a zaručujete sa, že sa nenachádzate v žiadnej z týchto krajín, alebo na žiadnom podobnom zozname. Tiež sa zaväzujete, že nebudete softvér Apple používať na žiadny účel, ktorý by bol zakázaný zákonmi Spojených štátov amerických, čo zahŕňa predovšetkým, ale nielen vyvíjanie, navrhovanie, výrobu alebo produkciu riadených striel a nukleárnych, chemických alebo biologických zbraní.";
"Part42" = "9. Koncoví používatelia v štátnej správe. Softvér Apple a súvisiaca dokumentácia sú „komerčnými položkami“, pričom tento pojem je definovaný v americkej Zbierke federálnych predpisov 48 C.F.R. §2.101, pozostávajúc z „komerčného počítačového softvéru“ a „dokumentácie ku komerčnému počítačovému softvéru“, pričom tieto pojmy sa spomínajú v uvedenej Zbierke 48 C.F.R. §12.212 alebo 48 C.F.R. §227.7202, podľa príslušnosti. V súlade so Zbierkou federálnych predpisov 48 C.F.R. §12.212 alebo 48 C.F.R. §227.7202-1 až 227.7202-4, podľa príslušnosti, komerčný počítačový softvér a dokumentácia ku komerčnému počítačovému softvéru sú licencované americkým vládnym používateľom (a) len ako komerčné položky a (b) len s tými právami, ktoré boli udelené všetkým ostatným bežným koncovým používateľom v súlade s tu uvedenými zmluvnými podmienkami. Ešte nepublikované práva sú vyhradené podľa autorského práva Spojených štátov amerických.";
"Part43" = "10. Kontrolné zákony a oddeliteľnosť. Táto licencia bude spravovaná a vykladaná v súlade so zákonmi štátu Kalifornia s výnimkou konfliktu právnych princípov. Táto licencia by nemala byť riadená Dohodou Spojených národov o zmluvách o medzinárodnom predaji tovarov, ktorých aplikácia je jasne vylúčená. Ak ste spotrebiteľ s pobytom v Spojenom kráľovstve, bude táto licencia podliehať miestnym zákonom a jurisdikcii miesta vášho pobytu. Ak z akýchkoľvek príčin vznesie súd kompetentného právneho systému námietku neuplatniteľnosti akejkoľvek klauzuly, alebo prehlási jej časť za právne neúčinnú, zvyšok tejto licencie zostáva v plnej platnosti a moci.";
"Part44" = "11. Kompletná dohoda; úradný jazyk. Táto licencia utvára celú dohodu medzi vami a Apple, vzťahujúcu sa na softvér Apple a nahrádza všetky predošlé a súčasné dohody, týkajúce sa tejto veci. Žiadne dodatky ani modifikácie tejto licencie nebudú záväzné, pokiaľ nebudú v písomnej forme a podpísané spoločnosťou Apple. Preklad tejto licencie do akéhokoľvek jazyka vznikol na základe lokálnych požiadaviek a v prípade nezhody medzi anglickou a neanglickou verziou platí pôvodná anglická verzia do rozsahu, nezakázaného miestnymi právnymi normami.";
"Part45" = "12. Informácie o tretích stranách. Časti softvéru Apple môžu používať alebo zahŕňať softvér tretích strán a iné materiály chránené autorskými právami. Informácie, zmluvné podmienky a vzdanie sa nároku na takéto materiály sú obsiahnuté v elektronickej dokumentácií k softvéru Apple a vaše použitie takýchto materiálov podlieha ich vlastným zmluvným podmienkam.";
"Part46" = "EA1576";
"Part47" = "16. 08. 2018";